app/controllers/bookings_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 10)
INSERT INTO `bookings` (`from`, `to`, `seats_remaining`, `pickup_datetime`, `created_at`, `updated_at`, `vehicle_type`) VALUES(1.2, 1.2, 5, '2014-09-20 07:26:46', '2014-09-20 14:22:34', '2014-09-20 14:22:34', 0)
INSERT INTO `users` (`name`, `email`, `gender`, `created_at`, `updated_at`) VALUES('srini', 'karthickpdy@gmail.com', 'male', '2014-09-20 14:43:44', '2014-09-20 14:43:44')
---
	def create
		user=User.find params.delete(:id)
		no_ppl=params.delete(:no_ppl)
		booking_val=JSON.parse(params[:bookings])
		booking_val[:pickup_datetime.to_s]=booking_val[:pickup_datetime.to_s].to_time
		# params[:bookings][:seats_remaining]=params[:bookings][:seats_remaining]
		booking_val[:seats_remaining] = CAR_SEATS_MAPPING[booking_val[:vehicle_type.to_s]] - no_ppl.to_i
		new_booking = user.bookings.build booking_val
		new_booking.save!

SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT `bookings`.* FROM `bookings` INNER JOIN `user_bookings` ON (`bookings`.`id` = `user_bookings`.`booking_id`) INNER JOIN `users` ON (`users`.`id` = `user_bookings`.`user_id`) WHERE (bookings.from = 1.2 AND bookings.to = 1.2 AND (pickup_datetime BETWEEN '2014-09-20 12:41:46' AND '2014-09-20 12:56:46') AND vehicle_type =2 AND users.gender = 'male' AND seats_remaining >= '4') ORDER BY pickup_datetime
---
	def search
		booking_val=JSON.parse(params[:bookings])
		user=User.find params[:id]
		booking_val[:pickup_datetime.to_s]=booking_val[:pickup_datetime.to_s].to_time
		pickup_datetime_ago = 15.minutes.ago booking_val[:pickup_datetime.to_s]

		conditions = ["bookings.from = ? AND bookings.to = ? AND (pickup_datetime BETWEEN ? AND ?) AND vehicle_type =? AND users.gender = ? AND seats_remaining >= ?",
					booking_val[:from.to_s],booking_val[:to.to_s],pickup_datetime_ago,
					booking_val[:pickup_datetime.to_s],
					booking_val[:vehicle_type.to_s],
					user.gender,
					params[:no_ppl]
					]
		search_result = Booking.find(:all,:joins=>:users,:conditions=>conditions,
								:order=>'pickup_datetime')

SELECT * FROM `users` WHERE (`users`.`id` = 2)
SELECT * FROM `bookings` WHERE (`bookings`.`id` = 7)
UPDATE `bookings` SET `seats_remaining` = 2, `updated_at` = '2014-09-20 16:17:47' WHERE `id` = 7
---
	def join_ride
		user = User.find(params[:id])
		no_ppl = params[:no_ppl]
		booking_val = JSON.parse(params[:bookings])
		booking_id  = booking_val[:id.to_s]
		current_booking=Booking.find(booking_id)
		seats_remaining_in_this_ride = current_booking.seats_remaining
		no_ppl = params[:no_ppl]
		updated_seats = seats_remaining_in_this_ride - no_ppl.to_i
		current_booking.update_attributes(:seats_remaining => updated_seats)